# Id Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Connector..::..Id Property
Connector Class See Also
---
A unique identifier to identify this connector.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public int Id { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Id As Integer
	Get
```

Visual C++
---
```text
public:
property int Id {
	int get ();
}
```

# See Also
Connector Class
Autodesk.Revit.DB Namespace